from docxtpl import DocxTemplate

tpl = DocxTemplate(r"/Users/louzeyu/PycharmProjects/CreateReport/template/不动产测量报告.docx")  # 加载模板文件

test_date={
    "宗地代码":"330782102236JC00588",
    "权利人" : "朱逢凯、朱锦青、朱智建",
    "身份证号":"330782199402050810",
    "联系电话":"13705798101",
    "地址":"义亭镇江岸村木桥18幢8号",
    "所有权":"义乌市义亭镇江岸村农民集体",
    "土地权属依据":"义亭镇农建字[2019]第002号",
    "其它权属依据":"义亭镇（街）农处字[2025]第5号",
    "共有情况":"共同共有",
    "建成年份":"2008",
    "批准面积":"120",
    "占地面积":"120.22",
    "总层数":"5",
    "所在层":"1-5",
    "建筑面积(地上)":"382.99",
    "建筑面积(地下)":"130",
    "总建筑面积":"512.99",
    "地上规划面积":"375.88",
    "总规划面积":"495.88",
    "地上超占面积":"7.11",
    "地下超占面积":"10",
    "合计超占":"17.11",
    "权利类型":"宅基地使用权",
    "权利性质":"批准拨用",
    "批准用途":"072农村宅基地",
    }

tpl.render(test_date)

tpl.save("test2.docx")
